{
  "symptoms": [
    {
      "symptom_name": "fever",
      "keywords": ["temperature", "pyrexia", "hot", "febrile"],
      "follow_up_questions": [
        "How long have you had the fever?",
        "What is your temperature, if you've measured it?",
        "Are there any other symptoms accompanying the fever?"
      ],
      "basic_triage_points": [
        "Fever lasting more than 3 days warrants attention.",
        "A temperature above 103°F (39.4°C) is a significant concern.",
        "Fever with confusion, stiff neck, or difficulty breathing needs immediate medical evaluation."
      ]
    },
    {
      "symptom_name": "cough",
      "keywords": ["coughing", "hacking", "whooping"],
      "follow_up_questions": [
        "How long have you been coughing?",
        "Is the cough dry or are you coughing up phlegm? If phlegm, what color is it?",
        "Do you have any other symptoms like shortness of breath or chest pain?"
      ],
      "basic_triage_points": [
        "A cough lasting more than 2-3 weeks should be checked by a doctor.",
        "Coughing up blood is an urgent medical sign.",
        "Cough accompanied by wheezing or severe shortness of breath requires prompt attention."
      ]
    },
    {
      "symptom_name": "headache",
      "keywords": ["head pain", "migraine", "cephalalgia"],
      "follow_up_questions": [
        "Can you describe the location and type of pain (e.g., throbbing, sharp, dull)?",
        "How long has the headache lasted, and is it constant or intermittent?",
        "Are there any other symptoms like vision changes, nausea, or sensitivity to light/sound?"
      ],
      "basic_triage_points": [
        "A sudden, severe headache (often described as 'the worst headache of your life') is an emergency.",
        "Headache accompanied by fever, stiff neck, confusion, or seizures requires immediate medical attention.",
        "Frequent or worsening headaches should be discussed with a healthcare provider."
      ]
    },
    {
      "symptom_name": "stomach ache",
      "keywords": ["abdominal pain", "pet dard", "gastric pain", "belly ache", "gas", "acidity", "heartburn"],
      "follow_up_questions": [
        "Where exactly in your stomach do you feel the pain?",
        "Can you describe the pain? Is it cramping, burning, sharp, or dull?",
        "Have you experienced any bloating, excessive gas, or changes in bowel habits?",
        "Is the pain related to eating food?"
      ],
      "basic_triage_points": [
        "Severe abdominal pain that comes on suddenly needs immediate medical attention.",
        "Pain accompanied by fever, vomiting blood, or black stools is an emergency.",
        "Persistent acidity or heartburn despite dietary changes may require consultation."
      ]
    },
    {
      "symptom_name": "diarrhea",
      "keywords": ["loose motions", "dast", "watery stools", "frequent stools"],
      "follow_up_questions": [
        "How many times have you had loose motions today?",
        "Is there any blood or mucus in the stool?",
        "Are you experiencing any other symptoms like fever, vomiting, or abdominal cramps?",
        "Do you feel very weak or dehydrated (e.g., dry mouth, little urination)?"
      ],
      "basic_triage_points": [
        "Diarrhea lasting more than 2-3 days, especially in children or elderly, needs medical advice.",
        "Signs of dehydration (dry mouth, decreased urination, dizziness) with diarrhea require prompt medical attention.",
        "Bloody diarrhea is a serious sign and needs immediate medical evaluation."
      ]
    },
    {
      "symptom_name": "vomiting",
      "keywords": ["nausea", "puking", "ulti", "throwing up", "emesis"],
      "follow_up_questions": [
        "How many times have you vomited?",
        "What does the vomit look like? Is there any blood or bile (greenish color)?",
        "Are you able to keep any food or liquids down?",
        "Do you have other symptoms like diarrhea, fever, or severe headache?"
      ],
      "basic_triage_points": [
        "Persistent vomiting where you cannot keep liquids down can lead to dehydration and needs medical attention.",
        "Vomiting blood or what looks like coffee grounds is an emergency.",
        "Vomiting accompanied by severe headache, stiff neck, or confusion requires immediate medical care."
      ]
    },
    {
      "symptom_name": "skin rash",
      "keywords": ["rash", "hives", "itchy skin", "boils", "blisters"],
      "follow_up_questions": [
        "Where on your body is the rash located?",
        "What does the rash look like (e.g., red spots, bumps, blisters)? Is it itchy or painful?",
        "Have you recently used any new soaps, lotions, medications, or eaten new foods?",
        "Do you have a fever or any other symptoms along with the rash?"
      ],
      "basic_triage_points": [
        "A rash that spreads rapidly or covers the whole body needs medical evaluation.",
        "A rash accompanied by fever, difficulty breathing, or swelling of the face/lips/tongue is an emergency.",
        "Painful, blistering rashes, or rashes that look infected (e.g., pus, increasing redness) should be seen by a doctor."
      ]
    },
    {
      "symptom_name": "joint pain",
      "keywords": ["arthritis", "gathiya", "joint swelling", "sore joints", "jodo ka dard"],
      "follow_up_questions": [
        "Which joints are affected? Is it one joint or multiple joints?",
        "Is there any swelling, redness, or warmth around the painful joint(s)?",
        "Is the pain worse at certain times of the day, like in the morning or after activity?",
        "Have you had any recent injury, fever, or rash?"
      ],
      "basic_triage_points": [
        "Sudden, severe joint pain, especially with inability to move the joint or bear weight, needs medical attention.",
        "Joint pain accompanied by fever and rash can be indicative of certain infections (e.g., dengue, chikungunya) and should be evaluated.",
        "Persistent or worsening joint pain, especially with swelling, should be discussed with a doctor."
      ]
    },
    {
      "symptom_name": "shortness of breath",
      "keywords": ["difficulty breathing", "breathless", "can't catch breath", "saans phoolna", "saans lene mein takleef", "heavy breathing"],
      "follow_up_questions": [
        "When do you feel short of breath? Is it when you are resting, or during activity?",
        "Did it start suddenly or gradually?",
        "Do you have any other symptoms like chest pain, cough, or wheezing?",
        "Do you have a history of asthma or any heart conditions?"
      ],
      "basic_triage_points": [
        "Sudden or severe shortness of breath, especially with chest pain or dizziness, is an emergency and needs immediate medical attention.",
        "Shortness of breath that occurs at rest or wakes you up from sleep should be evaluated by a doctor promptly.",
        "If shortness of breath is accompanied by swelling in your feet or ankles, consult a doctor."
      ]
    },
    {
      "symptom_name": "chest pain",
      "keywords": ["chest discomfort", "heart pain", "chest pressure", "tightness in chest", "seene mein dard", "chhaati mein dard"],
      "follow_up_questions": [
        "Can you describe the chest pain? Is it sharp, dull, burning, pressure-like, or a squeezing sensation?",
        "Where exactly is the pain? Does it spread to your arm, jaw, neck, or back?",
        "How long has it been there? Is it constant or does it come and go?",
        "Is it worse with breathing or movement? Do you have other symptoms like sweating, nausea, or shortness of breath?"
      ],
      "basic_triage_points": [
        "Sudden, severe chest pain, especially if it feels like pressure or squeezing, lasts more than a few minutes, or is accompanied by shortness of breath, sweating, nausea, or pain radiating to the arm/jaw, is a medical emergency. Call for help immediately.",
        "Chest pain that worsens with exertion and improves with rest should be evaluated by a doctor.",
        "Any unexplained chest pain warrants medical attention."
      ]
    },
    {
      "symptom_name": "fatigue",
      "keywords": ["weakness", "tiredness", "lethargy", "no energy", "exhaustion", "kamzori", "thakaan"],
      "follow_up_questions": [
        "How long have you been feeling this fatigue or weakness?",
        "Is it affecting your daily activities? How severe is it?",
        "Are you getting enough sleep? Have there been any recent changes in your stress levels or diet?",
        "Do you have any other symptoms like fever, weight loss, or sadness?"
      ],
      "basic_triage_points": [
        "Persistent, unexplained fatigue that doesn't improve with rest should be discussed with a doctor.",
        "Fatigue accompanied by significant weight loss, fever, or other concerning symptoms needs medical evaluation.",
        "Sudden, severe weakness, especially on one side of the body, can be a sign of a stroke and is an emergency."
      ]
    },
    {
      "symptom_name": "body aches",
      "keywords": ["muscle pain", "sore muscles", "aches and pains"],
      "follow_up_questions": [
        "Where in your body are you experiencing the aches? Is it all over or in specific areas?",
        "How would you describe the pain - dull, sharp, throbbing?",
        "Did the body aches start after any specific activity, illness, or injury?",
        "Are you experiencing other symptoms like fever, chills, or fatigue?"
      ],
      "basic_triage_points": [
        "Body aches accompanied by high fever and rash should be evaluated by a doctor (e.g., could be dengue, chikungunya).",
        "Severe, localized muscle pain, especially with swelling or weakness in one limb, needs medical attention.",
        "Generalized body aches with flu-like symptoms often resolve with rest, but if severe or persistent, consult a doctor."
      ]
    },
    {
      "symptom_name": "sore throat",
      "keywords": ["throat pain", "gale mein kharash", "gale mein dard", "difficulty swallowing"],
      "follow_up_questions": [
        "How long has your throat been sore?",
        "Is it painful to swallow? Do you have any difficulty breathing?",
        "Have you noticed any white spots in your throat or swollen glands in your neck?",
        "Do you have other symptoms like fever, cough, or runny nose?"
      ],
      "basic_triage_points": [
        "A sore throat with high fever, difficulty swallowing or breathing, or a rash needs immediate medical attention.",
        "If a sore throat is severe and lasts for more than a few days, or if you see white spots on your tonsils, consult a doctor.",
        "Most sore throats are viral and get better on their own with home care like gargling with salt water and staying hydrated."
      ]
    },
    {
      "symptom_name": "loss of taste or smell",
      "keywords": ["anosmia", "ageusia", "can't taste", "can't smell", "swad na aana", "gandh na aana"],
      "follow_up_questions": [
        "When did you first notice the loss of taste or smell? Was it sudden or gradual?",
        "Is it a complete loss, or is your sense of taste/smell just reduced?",
        "Are you experiencing any other symptoms, such as a stuffy nose, cough, fever, or fatigue?",
        "Have you had any recent head injury or sinus infection?"
      ],
      "basic_triage_points": [
        "Sudden loss of taste or smell can be a symptom of viral infections like COVID-19; consider testing and isolation as per local guidelines.",
        "If loss of taste or smell persists for more than a couple of weeks, consult a doctor.",
        "Loss of smell can also be associated with nasal polyps or neurological conditions and may need evaluation if persistent."
      ]
    },
    {
      "symptom_name": "constipation",
      "keywords": ["difficulty passing stool", "hard stools", "infrequent bowel movements", "qabz", "kabj"],
      "follow_up_questions": [
        "How long have you been constipated? How often are you having bowel movements compared to your usual?",
        "Are your stools hard, dry, or difficult to pass?",
        "Are you experiencing any abdominal pain, bloating, or straining?",
        "Have there been any recent changes in your diet, fluid intake, or activity level?"
      ],
      "basic_triage_points": [
        "Constipation accompanied by severe abdominal pain, vomiting, or inability to pass gas needs prompt medical attention.",
        "If constipation is a new problem for you, lasts longer than 1-2 weeks despite home care, or if you see blood in your stool, consult a doctor.",
        "Increasing fiber and fluid intake, along with regular exercise, can often help relieve constipation."
      ]
    },
    {
      "symptom_name": "night sweats",
      "keywords": ["sweating at night", "drenching sweats", "raat ko paseena aana"],
      "follow_up_questions": [
        "How often are you experiencing these night sweats? Are they drenching, requiring you to change clothes or bedding?",
        "Have you had them for a long time, or is this a new symptom?",
        "Are you experiencing any other symptoms like fever, unexplained weight loss, cough, or fatigue?",
        "Are you taking any new medications?"
      ],
      "basic_triage_points": [
        "Persistent night sweats, especially if accompanied by fever, unexplained weight loss, or persistent cough, require medical evaluation (e.g., to rule out infections like TB or other conditions).",
        "Occasional night sweats can be due to a warm room or heavy bedding, but if they are regular and drenching, see a doctor.",
        "Some medications can cause night sweats; discuss with your doctor if you suspect this."
      ]
    },
    {
      "symptom_name": "unexplained weight loss",
      "keywords": ["losing weight without trying", "sudden weight loss", "wajan kam hona bina karan"],
      "follow_up_questions": [
        "How much weight have you lost, and over what period of time?",
        "Have you made any changes to your diet or exercise routine?",
        "Are you experiencing any other symptoms like loss of appetite, fatigue, fever, pain, or changes in bowel habits?",
        "Do you have any pre-existing medical conditions?"
      ],
      "basic_triage_points": [
        "Significant unexplained weight loss (e.g., more than 5% of your body weight in 6-12 months) should always be evaluated by a doctor.",
        "Weight loss accompanied by other symptoms like persistent cough, changes in bowel habits, or lumps needs medical investigation.",
        "It's important to rule out underlying medical conditions if you are losing weight without trying."
      ]
    },
    {
      "symptom_name": "dental pain",
      "keywords": ["toothache", "tooth pain", "gum pain", "daant mein dard", "cavity pain"],
      "follow_up_questions": [
        "Which tooth or area of your mouth is painful? Can you describe the pain (sharp, throbbing, dull, constant, intermittent)?",
        "Is the pain triggered by hot, cold, or sweet things, or by chewing?",
        "Have you noticed any swelling, redness, or bleeding in your gums, or a bad taste in your mouth?",
        "Have you had any recent dental procedures or injury to your mouth?"
      ],
      "basic_triage_points": [
        "Severe toothache, especially if accompanied by fever, facial swelling, or difficulty opening your mouth or swallowing, needs urgent dental or medical attention as it could be a sign of infection.",
        "Persistent toothache, even if mild, should be checked by a dentist to prevent worsening problems like cavities or gum disease.",
        "Good oral hygiene, including regular brushing and flossing, can help prevent many dental problems."
      ]
    }
  ]
}
